# def add_indexes(data, start_index=1):
#     for item in data:
#         item["index"] = start_index
#         start_index += 1
#         if "children" in item:
#             start_index = add_indexes(item["children"], start_index)
#     return start_index
#
# json_data = {
#     "hrbase_data_list": [
#         {
#             "id": 338,
#             "label": "全球电池营销中心",
#             "children": [
#                 {
#                     "id": 183,
#                     "label": "全球电池销售中心"
#                 }
#             ]
#         },
#         {
#             "id": 629,
#             "label": "润阳越南项目",
#             "children": [
#                 {
#                     "id": 652,
#                     "label": "越南切片"
#                 },
#                 {
#                     "id": 676,
#                     "label": "越南拉晶"
#                 }
#             ]
#         },
#         {
#             "id": 677,
#             "label": "工程事业部",
#             "children": [
#                 {
#                     "id": 13,
#                     "label": "工程部"
#                 }
#             ]
#         }
#     ]
# }
#
# add_indexes(json_data["hrbase_data_list"])
#
# print(json_data)

import pandas as pd
# data = (('人力资源中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', '综合', 1, 9999.0, 1.0, 12.0, 0.0012001200120012002), ('人力资源中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', 'Total', 1, 9999.0, 1.0, 12.0, 0.0012001200120012002), ('人力资源中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '知识类', '高层', 1, 12.0, 3.0, 99.9999, 8.333325), ('人力资源中心', '知识类', 'Total', 1, 12.0, 3.0, 99.9999, 8.333325), ('人力资源中心', 'Total', 'Total', 2, 10011.0, 4.0, 111.9999, 0.011187683548097092), ('光伏研究院', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('Total', 'Total', 'Total', 2, 10011.0, 4.0, 111.9999, 0.011187683548097092))
data=(('人力资源中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', '综合', 1, 9999.0, 1.0, 0.0, 0.0), ('人力资源中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '技能类', 'Total', 1, 9999.0, 1.0, 0.0, 0.0), ('人力资源中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('人力资源中心', '知识类', '高层', 1, 12.0, 3.0, 0.0, 0.0), ('人力资源中心', '知识类', 'Total', 1, 12.0, 3.0, 0.0, 0.0), ('人力资源中心', 'Total', 'Total', 2, 10011.0, 4.0, 0.0, 0.0), ('光伏研究院', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('光伏研究院', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球战略供应链管理中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球电池营销中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球组件营销中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('全球财务中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('工程事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('战略与运营管理中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('润阳越南项目', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业一部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电池事业二部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('电站事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('硅料事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('组件事业部', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '态度类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '技能类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '中层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '基层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '综合', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', '高层', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', '知识类', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('集团质量中心', 'Total', 'Total', 0, 0.0, 0.0, 0.0, 0.0), ('Total', 'Total', 'Total', 2, 10011.0, 4.0, 0.0, 0.0))

# columns = ['部门', '类别', '层级', '基层', '中层', '高层', '综合', '']
#
# # 创建DataFrame
# df = pd.DataFrame(data, columns=columns)
#
# # 打印DataFrame
# print(df)

#
#
#
# result = {}
#
# for item in data:
#     department, category, level, content_number, content_people_number, content_duration, content_satisfaction, content_satisfaction_avg = item
#
#     if department not in result:
#         result[department] = {}
#     if category not in result[department]:
#         result[department][category] = {}
#     if level not in result[department][category]:
#         result[department][category][level] = {
#             'content_number': content_number,
#             'content_people_number': content_people_number,
#             'content_duration': content_duration,
#             'content_satisfaction': content_satisfaction,
#             'content_satisfaction_avg': content_satisfaction_avg
#         }
#
# print(result)




result = []

for entry in data:
    department, category, level, content_number, content_people_number, content_duration, content_satisfaction, content_satisfaction_avg = entry
    result.append({
        "department": department,
        "category": category,
        "level": level,
        "content_number": str(content_number),
        "content_people_number": float(content_people_number),
        "content_duration": float(content_duration),
        "content_satisfaction": float(content_satisfaction),
        "content_satisfaction_avg": float(content_satisfaction_avg)
    })
print(result)



# import json
# json_data = json.dumps(result, indent=2)
# print(json_data)


original_list = result

transformed_list = []

# Create a dictionary to store the transformed data
department_category_data = {}

# Process each item in the original list
for item in original_list:
    department = item['department']
    category = item['category']
    level = item['level']
    content_number = item['content_number']

    if department not in department_category_data:
        department_category_data[department] = {}

    if category not in department_category_data[department]:
        department_category_data[department][category] = {
            'department': department,
            'category': category,
            'content_number_中层': '0',
            'content_number_基层': '0',
            'content_number_综合': '0',
            'content_number_高层': '0',
            'content_people_number': 0.0,
            'content_duration': 0.0,
            'content_satisfaction': 0.0,
            'content_satisfaction_avg': 0.0
        }

    department_category_data[department][category]['content_number_' + level] = content_number
    department_category_data[department][category]['content_people_number'] = item['content_people_number']
    department_category_data[department][category]['content_duration'] = item['content_duration']
    department_category_data[department][category]['content_satisfaction'] = item['content_satisfaction']
    department_category_data[department][category]['content_satisfaction_avg'] = item['content_satisfaction_avg']

# Convert the department_category_data dictionary back to a list
for department_data in department_category_data.values():
    transformed_list.extend(department_data.values())

print(transformed_list)






















































"""
class TrainingContent(models.Model):  # 培训内容
    content_lecturer = models.ForeignKey(to='TrainingLecturer', on_delete=models.SET_NULL, null=True,
                                                  blank=True, verbose_name='培训讲师',
                                                  related_name='content_lecturer', db_constraint=False)
    content_title = models.CharField(max_length=255, null=True, blank=True, verbose_name='培训主题/课题')
    content_part = models.ForeignKey(to='employee.HrDepartment', on_delete=models.DO_NOTHING, db_constraint=False,
                                     null=True, blank=True, verbose_name='培训基地部门')
    content_module = models.CharField(max_length=255, null=True, blank=True, verbose_name='模块')
    content_group = models.CharField(max_length=255, null=True, blank=True, verbose_name='组')
    content_type = models.ForeignKey(to=TrainingContentType, on_delete=models.DO_NOTHING, db_constraint=False,
                                     null=True, blank=True, verbose_name='培训类型')
    content_category = models.ForeignKey(to=TrainingContentCategory, on_delete=models.DO_NOTHING, db_constraint=False,
                                         null=True, blank=True, verbose_name='培训类别')  #知识类
    content_level = models.ForeignKey(to=TrainingContentLevel, on_delete=models.DO_NOTHING, db_constraint=False,
                                      null=True, blank=True, verbose_name='培训层级')  #高层 中层
    content_manner = models.CharField(max_length=255, null=True, blank=True,
                                      choices=(('在线', '在线'), ('现场', '现场')), verbose_name='培训方式')
    content_begin_date = models.DateTimeField(null=True, blank=True, verbose_name='开始培训日期')
    content_end_date = models.DateTimeField(null=True, blank=True, verbose_name='截至培训日期')
    content_duration = models.CharField(max_length=255, null=True, blank=True, verbose_name='培训时长(H)')
    content_object = models.CharField(max_length=255, null=True, blank=True, verbose_name='培训对象')
    content_people_number = models.CharField(max_length=255, null=True, blank=True, verbose_name='参训人数')
    # content_type_of_lecturer = models.CharField(max_length=255, null=True, blank=True,
    #                                             choices=(('内部讲师', '内部讲师'), ('外部讲师', '外部讲师')),
    #                                             verbose_name='讲师类型')
    content_satisfaction = models.CharField(max_length=255, null=True, blank=True, verbose_name='培训满意度')

"""